# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn' # Needed to install fonts

# Spatie Medialibrary
brew 'gifsicle'
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'

# Development
brew 'composer'
brew 'imagemagick'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'php'
brew 'redis'
brew 'yarn'

# Apps
cask '1password'
cask 'background-music'
cask 'bartender'
cask 'caffeine'
cask 'dbngin'
cask 'discord'
cask 'divvy'
cask 'docker'
cask 'dropbox'
cask 'figma'
cask 'firefox'
cask 'gifox'
cask 'github'
cask 'gitkraken'
cask 'google-chrome'
cask 'imageoptim'
cask 'insomnia'
cask 'iterm2'
cask 'itsycal'
cask 'macs-fan-control'
cask 'pastebot'
cask 'phpmon'
cask 'rocket'
cask 'slack'
cask 'spotify'
cask 'the-unarchiver'
cask 'transmit'
cask 'tunnelbear'
cask 'visual-studio-code'
cask 'zoom'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Battery Indicator', id: 1206020918
mas 'Bear', id: 1091189122
mas 'Divvy', id: 413857545
mas 'iMovie', id: 408981434
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
